"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.default = {
    SETTINGS_TITLE: 'Настройки Tags Color Files',
    PLUGIN_DESCRIPTION: 'Tags Color Files выделяет файлы в проводнике Obsidian согласно заданным вами правилам окрашивания. При добавлении к файлу тега, для которого создано правило, плагин автоматически окрашивает его в соответствующий цвет в проводнике.',
    GENERAL_SECTION: 'Основные',
    COLOR_METHOD_NAME: 'Способ окрашивания',
    COLOR_METHOD_DESC: 'Если выбран вариант "Точки перед текстом" или "Точки после текста", до трёх цветных точек будут одновременно отображаться, если в файле содержится больше одного тега, для которого создано правило окрашивания.',
    COLOR_TEXT: 'Текст',
    COLOR_BG: 'Фон',
    COLOR_DOTS_BEFORE: 'Точки перед текстом',
    COLOR_DOTS_AFTER: 'Точки после текста',
    BACKUP_RESTORE: 'Резервное копирование и восстановление',
    EXPORT: 'Экспорт настроек',
    IMPORT: 'Импорт настроек',
    EXPORTED: 'Успешно экспортировано!',
    IMPORTED: 'Успешно импортировано!',
    INVALID_FILE: 'Ошибка: Некорректный файл',
    RULES_SECTION: 'Правила окрашивания',
    ADD_RULE_NAME: 'Добавить правило окрашивания',
    ADD_RULE_DESC: 'Введите тег и укажите цвет окрашивания файлов. Обратите внимание: Если к файлу добавлено несколько тегов, для которых создано правило, выбирается приоритетный.',
    ADD_RULE_BTN: 'Новое правило',
    TAG_PLACEHOLDER: '#тег'
};
